Revit 2024 API
FormattedText.SetSubscriptStatus Method (TextRange, Boolean)
 Sets the characters in a given text range to be subscript or not subscript.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void SetSubscriptStatus(
	TextRange textRange,
	bool isSubscript
)
Visual Basic
Public Sub SetSubscriptStatus ( _
	textRange As TextRange, _
	isSubscript As Boolean _
)
Visual C++
public:
void SetSubscriptStatus(
	TextRange^ textRange,
	bool isSubscript
)
Parameters
textRange
Type: Autodesk.Revit.DB.TextRange
 The given text range.
isSubscript
Type: System.Boolean
 The desired subscript status of characters in the given text range. True to set subscript, false to set not subscript.
Remarks
 Superscript and subscript are mutually exclusive. Applying the subscript status will automatically remove the superscript status.
 The given text range should not be empty.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  This text range is empty. -or- This start index of this text range is not within the text range identifying the entire text. -or- The end of this text range is not within the text range identifying the entire text.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FormattedText Class
SetSubscriptStatus Overload
Autodesk.Revit.DB Namespace